ch2/app/views/users/_user.html.erb

    <strong>First micropost:</strong>
    <%= user.microposts.first.content %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]